# Atividade de Pandas -
#### Conteúdo: 
- Join

**1) Escreva um programa usando pandas que irá fazer a juntar/concatenar os dois dataframes: um abaixo do outro**

In [ ]:
'''
d1:
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199


df2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
'''

In [6]:
import pandas as pd

df1 = pd.DataFrame({
        'id': ['id1', 'id2', 'id3', 'id4', 'id5'],
        'nome': ['Kelvin Sampaio', 'Roberto', 'Ana Julia', 'Bolsonaro', 'Lula'], 
        'idade': [23, 21, 19, 46, 51]})

df2 = pd.DataFrame({
        'id': ['id1', 'id2', 'id3', 'id4', 'id5'],
        'nome': ['Dunha', 'Fulano', 'Ciclano', 'Beltrano', 'seila'], 
        'Curso': ['ADS', 'ADM', 'MSI', 'GPI', 'AGRO']})

In [7]:
def data():
    print("DataFrame 1:")
    print(df1)
    print("-------------------------------------")
    print("DataFrame 2:")
    print(df2)
    print('\nMesclagem:')

In [8]:
data()
mesclagem = pd.concat([df1, df2])
print(mesclagem)

DataFrame 1:
    id            nome  idade
0  id1  Kelvin Sampaio     23
1  id2         Roberto     21
2  id3       Ana Julia     19
3  id4       Bolsonaro     46
4  id5            Lula     51
-------------------------------------
DataFrame 2:
    id      nome Curso
0  id1     Dunha   ADS
1  id2    Fulano   ADM
2  id3   Ciclano   MSI
3  id4  Beltrano   GPI
4  id5     seila  AGRO

Mesclagem:
    id            nome  idade Curso
0  id1  Kelvin Sampaio   23.0   NaN
1  id2         Roberto   21.0   NaN
2  id3       Ana Julia   19.0   NaN
3  id4       Bolsonaro   46.0   NaN
4  id5            Lula   51.0   NaN
0  id1           Dunha    NaN   ADS
1  id2          Fulano    NaN   ADM
2  id3         Ciclano    NaN   MSI
3  id4        Beltrano    NaN   GPI
4  id5           seila    NaN  AGRO

**2) Escreva um programa usando pandas que irá fazer a concatenação dos dois dataframes: um ao lado do outro**

In [9]:
'''
d1:
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199


df2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
'''

'\nd1:\nstudent_data1:\n  student_id              name  marks\n0         S1  Danniella Fenton    200\n1         S2      Ryder Storey    210\n2         S3      Bryce Jensen    190\n3         S4         Ed Bernal    222\n4         S5       Kwame Morin    199\n\n\ndf2:\n  student_id              name  marks\n0         S4  Scarlette Fisher    201\n1         S5  Carla Williamson    200\n2         S6       Dante Morse    198\n3         S7    Kaiser William    219\n4         S8   Madeeha Preston    201\n'

In [10]:
data()
mesclagem = pd.concat([df1, df2], axis=1)
mesclagem

DataFrame 1:
    id            nome  idade
0  id1  Kelvin Sampaio     23
1  id2         Roberto     21
2  id3       Ana Julia     19
3  id4       Bolsonaro     46
4  id5            Lula     51
-------------------------------------
DataFrame 2:
    id      nome Curso
0  id1     Dunha   ADS
1  id2    Fulano   ADM
2  id3   Ciclano   MSI
3  id4  Beltrano   GPI
4  id5     seila  AGRO

Mesclagem:

    id            nome  idade   id      nome Curso
0  id1  Kelvin Sampaio     23  id1     Dunha   ADS
1  id2         Roberto     21  id2    Fulano   ADM
2  id3       Ana Julia     19  id3   Ciclano   MSI
3  id4       Bolsonaro     46  id4  Beltrano   GPI
4  id5            Lula     51  id5     seila  AGRO

**3) Escreva um programa usando pandas que irá fazer uma junção usando as colunas em comuns entre os dois dataframes**

In [11]:
'''
d1:
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199


df2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
'''

'\nd1:\nstudent_data1:\n  student_id              name  marks\n0         S1  Danniella Fenton    200\n1         S2      Ryder Storey    210\n2         S3      Bryce Jensen    190\n3         S4         Ed Bernal    222\n4         S5       Kwame Morin    199\n\n\ndf2:\n  student_id              name  marks\n0         S4  Scarlette Fisher    201\n1         S5  Carla Williamson    200\n2         S6       Dante Morse    198\n3         S7    Kaiser William    219\n4         S8   Madeeha Preston    201\n'

In [16]:
data()

mesclagem = pd.merge(df1, df2, on=['id'])

mesclagem

DataFrame 1:
    id            nome  idade
0  id1  Kelvin Sampaio     23
1  id2         Roberto     21
2  id3       Ana Julia     19
3  id4       Bolsonaro     46
4  id5            Lula     51
-------------------------------------
DataFrame 2:
    id      nome Curso
0  id1     Dunha   ADS
1  id2    Fulano   ADM
2  id3   Ciclano   MSI
3  id4  Beltrano   GPI
4  id5     seila  AGRO

Mesclagem:

    id          nome_x  idade    nome_y Curso
0  id1  Kelvin Sampaio     23     Dunha   ADS
1  id2         Roberto     21    Fulano   ADM
2  id3       Ana Julia     19   Ciclano   MSI
3  id4       Bolsonaro     46  Beltrano   GPI
4  id5            Lula     51     seila  AGRO

**4) Escreva um programa usando pandas que irá fazer uma junção mantendo os registros correspondentes em ambos os dataframes**

In [ ]:
'''
d1:
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199


df2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
'''

In [14]:
data()

mesclagem = pd.merge(df1, df2, on=['id'])

mesclagem

DataFrame 1:
    id            nome  idade
0  id1  Kelvin Sampaio     23
1  id2         Roberto     21
2  id3       Ana Julia     19
3  id4       Bolsonaro     46
4  id5            Lula     51
-------------------------------------
DataFrame 2:
    id      nome Curso
0  id1     Dunha   ADS
1  id2    Fulano   ADM
2  id3   Ciclano   MSI
3  id4  Beltrano   GPI
4  id5     seila  AGRO

Mesclagem:

    id          nome_x  idade    nome_y Curso
0  id1  Kelvin Sampaio     23     Dunha   ADS
1  id2         Roberto     21    Fulano   ADM
2  id3       Ana Julia     19   Ciclano   MSI
3  id4       Bolsonaro     46  Beltrano   GPI
4  id5            Lula     51     seila  AGRO

**5) Escreva um programa usando pandas que irá fazer uma junção mantendo os registros apenas do dataframe à esquerda**

In [ ]:
'''
data1:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
data2:
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3
'''

In [33]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B':['B0', 'B1','B2']},
                       index=['K0', 'K1', 'K2'])

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                        'D':['D0', 'D2','D3']},
                      index=['K0', 'K2', 'K3'])

In [34]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2